/*Пусть G — неориентированный граф. Решить задачу о размещении военных  баз,
 * контролирующих  данную территорию. Территория разделена на районы,
 * размер которых известен. Известно, на максимальное  расстоянии от базы,
 * на котором район может контролироваться. Известно, какие районы являются соседними.
 * Требуется найти наименьшее возможное число военных баз и места для их размещения так,
 * чтобы вся территория контролировалась. */


using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace AlgoritmLab5.AlgoritmLab6.OOPModel
{
    public class MilitaryBase
    {

    }
}
